photon-cat/sb-private/lib/__tests__/fixtures/stm32-mini.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.1">
  <name>STM32F103_MINI</name>
  <peripherals>
    <peripheral>
      <name>RCC</name>
      <groupName>RCC</groupName>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x00</addressOffset>
          <resetValue>0x00000083</resetValue>
          <fields>
            <field><name>HSION</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>HSIRDY</name><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PLLON</name><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PLLRDY</name><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>APB2ENR</name>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field><name>IOPAEN</name><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>USART1EN</name><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOA</name>
      <groupName>GPIO</groupName>
      <baseAddress>0x40010800</baseAddress>
      <addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock>
      <registers>
        <register><name>CRL</name><addressOffset>0x00</addressOffset><resetValue>0x44444444</resetValue></register>
        <register><name>ODR</name><addressOffset>0x0C</addressOffset><resetValue>0x00000000</resetValue></register>
        <register><name>IDR</name><addressOffset>0x08</addressOffset><resetValue>0x00000000</resetValue></register>
        <register><name>BSRR</name><addressOffset>0x10</addressOffset><resetValue>0x00000000</resetValue></register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB</name>
      <baseAddress>0x40010C00</baseAddress>
    </peripheral>
    <peripheral>
      <name>USART1</name>
      <groupName>USART</groupName>
      <baseAddress>0x40013800</baseAddress>
      <addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock>
      <interrupt><name>USART1</name><value>37</value></interrupt>
      <registers>
        <register><name>SR</name><addressOffset>0x00</addressOffset><resetValue>0x000000C0</resetValue></register>
        <register><name>DR</name><addressOffset>0x04</addressOffset><resetValue>0x00000000</resetValue></register>
      </registers>
    </peripheral>
  </peripherals>
</device>
